#+TITLE: Modern AI Search
** Development Environment
#+NAME: header
#+BEGIN_SRC lisp :tangle yes :session no :results no
  (defpackage :agents-search
    (:use :cl))
  (in-package agents-search)
#+END_SRC

#+RESULTS: header
: #<PACKAGE "AGENTS-SEARCH">

#+BEGIN_SRC lisp :session yes :results no :tangle yes
  (defun stub-a-to-a (a)
      "A place holder for wished-for functions where the return type is the same as the input type."
      a)

  (defun stub-a-to-nil (a)
    "A place holder for wished-for functions where the return type may be different from the input."
    nil)
#+END_SRC
